am/AdditiveFOAM/tutorials/AMB2018-02-B/constant/heatSourceDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      heatSourceProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sources (beam);

/*---------------------------------------------------------------------------*\
Citation:
    G.L. Knapp, J. Coleman, M. Rolchigo, M. Stoyanov, A. Plotkowski,
    Calibrating uncertain parameters in melt pool simulations of additive 
    manufacturing (2023), https://doi.org/10.1016/j.commatsci.2022.11190.
\*---------------------------------------------------------------------------*/
beam
{
    pathName            scanPath;    

    absorptionModel     constant;
    
    constantCoeffs
    {
        eta             0.33;
    }
    
    heatSourceModel     superGaussian;
    
    superGaussianCoeffs
    {
        k               2.0;
        dimensions      (85.0e-6 85.0e-6 30e-6);
        nPoints         (10 10 10);
    }
}

// ************************************************************************* //
